In [ ]:
import pandas as pd
import datetime

In [72]:
valid_cols = ["NHA_NAME", "sex", "age", "datetime_arr", "fel_misd"]

In [73]:
def process_df(df):
    df = df[valid_cols].dropna()
    date_arr = []
    month_arr = []
    proper_time_arr = []
    for i in range(len(df)):
        datetime_arr = list(df["datetime_arr"])[i].split(" ") # extract date and time str

        date = datetime_arr[0].strip()
        time = datetime_arr[1].strip().split(":")
    
        realtime = int(time[0]) - 7
        if (realtime < 0):
            realtime = 24 + realtime
        proper_time_arr.append(f"{realtime}{time[1]}")
        
        calc_date = datetime.datetime.strptime(date, '%Y/%m/%d') 
        day = (calc_date.weekday() + 1) % 7
        date_arr.append(day)
        month_arr.append(calc_date.month-1)

    df = df.drop("datetime_arr", axis=1)
    df["day"] = date_arr
    df["month"] = month_arr
    df["time"] = proper_time_arr

    return df

In [74]:
arrests_2020 = pd.read_csv("./data/Arrests_2020.csv")
arrests_2020 = process_df(arrests_2020)
arrests_2020

              NHA_NAME sex age fel_misd  day  month  time
12        Dodge Flower   M  21        M    4      0  1610
13        Dodge Flower   M  21        M    4      0  1610
15     West University   M  24        M    5      0  1716
16     West University   M  24        M    5      0  1716
17        Dodge Flower   M  21        M    4      0  1610
...                ...  ..  ..      ...  ...    ...   ...
51531        Pie Allen   M  39        M    0      2  1738
51539     San Clemente   M  23        M    6      2  1804
51540     San Clemente   M  23        M    6      2  1804
51541     San Clemente   M  23        M    6      2  1804
51543         Downtown   M  65        M    0      2  1833

[37309 rows x 7 columns]

In [75]:
arrests_2021 = pd.read_csv("./data/Arrests_2021.csv")
arrests_2021 = process_df(arrests_2021)
arrests_2021

              NHA_NAME sex age fel_misd  day  month  time
3             Eastside   M  15        M    6      0  1144
4             Eastside   M  15        M    6      0  1144
5           Rita Ranch   F  25        M    6      0  1305
6      Garden District   M  34        F    6      0  1449
8      Garden District   M  34        F    6      0  1449
...                ...  ..  ..      ...  ...    ...   ...
45407            Amphi   F  49        M    2      1   109
45408    Flowing Wells   M  22        M    4      2   827
45412    Flowing Wells   M  22        M    4      2   827
45413    Flowing Wells   M  22             4      2   827
45419         Downtown   M  30        F    1      1   400

[32086 rows x 7 columns]

In [76]:
arrests_2020.to_csv('./clean_data/Arrests_2020_cleaned.csv', index=False)
arrests_2021.to_csv('./clean_data/Arrests_2021_cleaned.csv', index=False)